{
  "BlazorDemo": {
    "TitleFormat": "Blazor: {0} | DevExpress",
    "AssemblyName": "BlazorDemo",
    "Products": [
      {
        "Title": "Blazor Data Grid",
        "PageUri": "GridColumnTypes",
        "IconName": "grid",
        "Description": "A fast and responsive grid component with unlimited master-detail levels and unmatched data shaping capabilities."
      },
      {
        "Title": "Blazor Pivot Grid",
        "PageUri": "PivotGrid",
        "IconName": "pivot",
        "Description": "An Excel-inspired pivot table control engineered for multi-dimensional data analysis and cross-tab reporting."
      },
      {
        "Title": "Blazor Charts",
        "PageUri": "ChartSeriesTypes",
        "IconName": "charts",
        "Description": "Fast and lightweight chart component with 20+ data presentation types."
      },
      {
        "Title": "Blazor Scheduler",
        "PageUri": "SchedulerViewTypes",
        "IconName": "scheduler",
        "Description": "A fully-featured scheduling solution that easily displays a detailed snapshot of events/appointments in your web application across a single day or a week."
      },
      {
        "Title": "Blazor Data Editors",
        "PageUri": "Calendar",
        "IconName": "editors",
        "Description": "An extensive suite of data editors to be used standalone or within container components."
      },
      {
        "Title": "Blazor Navigation and Layout",
        "PageUri": "FormLayout",
        "IconName": "navigation",
        "Description": "A suite of navigation components including TreeView and Pager, in conjunction with layout components that are designed to make your UI adaptive."
      }
    ],
    "RootDemoPages": [
      {
        "Url": "",
        "Title": "Blazor UI Components",
        "Icon": "images/Overview.svg",
        "Keywords": "Blazor, components, overview, getting started, devexpress, demo",
        "Description": "DevExpress UI for Blazor ships with native user interface components (including a Data Grid, Pivot Grid, Charts and Scheduler) so you can design rich user experiences with both Blazor.",
        "OG_Title": "Native Blazor Components powered by DevExpress",
        "OG_Image": "https://static.devexpress.com/Products/Blazor/blazor-components-grid-pivot-scheduler-charts-editor-devexpress.jpg",
        "OG_Description": "DevExpress UI for Blazor ships with native user interface components (including a Data Grid, Pivot Grid, Charts and Scheduler) so you can design rich user experiences with both Blazor.",
        "OG_Url": "https://dxpr.es/2WogLq7"
      },
      {
        "Title": "Grid",
        "DemoPages": [
          {
            "Url": "GridColumnTypes",
            "Title": "Column Types",
            "Icon": "images/GridColumnType.svg",
            "Keywords": "blazor, components, data grid, datagrid, grid, column type, columns, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Data Grid supports column objects that display and edit different data types: text, numbers, dates, and Boolean values."
          },
          {
            "Url": "GridSortData",
            "Title": "Sort Data",
            "Keywords": "blazor, components, data grid, datagrid, grid, grid sort, grid sorting, datagrid sort, datagrid sorting, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Data Grid supports sorting data against multiple columns. A column's current sort order is indicated by a sort glyph displayed in the column header."
          },
          {
            "Url": "GridFilterRow",
            "Title": "Data Filter Row",
            "IsNew": true,
            "Keywords": "blazor, components, data grid, datagrid, grid, grid filter, grid filtering, datagrid filter, datagrid filtering, data filter, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Data Grid supports the Filter Row that allows users to filter data."
          },
          {
            "Url": "GridTemplate",
            "Title": "Templates",
            "Icon": "images/GridTemplates.svg",
            "Keywords": "blazor, components, data grid, datagrid, grid, template, cell template, cell editor template, row preview template, preview sections, custom row appearance, custom cell appearance, custom content in rows, custom content in cells, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Data Grid supports templates that allow you to customize cell appearance, the edit form’s layout, and row preview sections.",
            "DemoPageSections": [
              {
                "Id": "ColumnTemplates",
                "Title": "Column Templates"
              },
              {
                "Id": "RowPreviewTemplate",
                "Title": "Row Preview Template"
              }
            ]
          },
          {
            "Url": "GridCascadingEditors",
            "Title": "Cascading Editors",
            "Icon": "images/GridCascadingEditors.svg",
            "Keywords": "blazor, components, data grid, datagrid, grid, cascade editors, cascading combobox, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Data Grid allows you to implement cascade logic within grid's edit form using DevExpress ComboBox for Blazor components."
          },
          {
            "Url": "GridEditFormTemplateValidation",
            "Title": "Edit Form Validation",
            "Icon": "images/GridEditFormTemplate.svg",
            "Keywords": "blazor, components, data grid, datagrid, grid, template, form validation, form template, form template validation, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Data Grid allows you to implement a custom edit form with built-in data validation."
          },
          {
            "Url": "GridLargeDataBase",
            "Title": "Large Data Source",
            "Icon": "images/GridLargeData.svg",
            "Keywords": "blazor, components, data grid, datagrid, grid, data bind, data binding, entity framework bind, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Data Grid delivers high performance when the component is bound to a large data source."
          },
          {
            "Url": "GridResizeColumns",
            "Title": "Resize Columns",
            "Keywords": "blazor, components, data grid, datagrid, grid, column, columns, resizing, resize, column resizing, column resize, resizing columns, column width, column size, devexpress, demo, sample, example",
            "Description": "The DevExpress Blazor Data Grid allows users to resize columns in two modes: change the width of the column to the right or the width of the entire grid."
          },
          {
            "Url": "GridPagingAndScrolling",
            "Title": "Paging and Scrolling",
            "Keywords": "blazor, components, data grid, datagrid, grid, scrolling, vertical scrolling, horizontal scrolling, virtual scrolling, load records on demand, paging, pager, pages, go to page, page size selection, custom page size, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Data Grid supports horizontal scrolling, vertical scrolling, and virtual scrolling (loading data on demand). The Data Grid displays a pager that enables data navigation. ",
            "DemoPageSections": [
              {
                "Id": "VerticalScrolling",
                "Title": "Vertical Scrolling"
              },
              {
                "Id": "HorizontalScrolling",
                "Title": "Horizontal Scrolling"
              },
              {
                "Id": "FixedColumns",
                "Title": "Fixed Columns",
                "IsNew": true,
                "Keywords": "blazor, components, data grid, datagrid, grid, fixed columns, fixed column, column fixing, fix columns, frozen columns, freeze columns, anchored columns, anchor columns, locked columns, lock columns, devexpress, demo, sample, example",
                "Description": "The DevExpress Blazor Data Grid allows you to anchor (fix) columns to the left or right edge."
              },
              {
                "Id": "VirtualScrolling",
                "Title": "Virtual Scrolling"
              },
              {
                "Id": "Paging",
                "Title": "Paging"
              }
            ]
          },
          {
            "Url": "GridMasterDetail",
            "Title": "Master-Detail View",
            "Keywords": "blazor, components, data grid, datagrid, grid, master grid, detail grid, master-detail relationship, master-detail view, detail row, devexpress, demo, sample, example",
            "Description": "The DevExpress Data Grid for Blazor component allows you to build master-detail layouts and relationships of any complexity and depth with a detail row template."
          },
          {
            "Url": "GridGrouping",
            "Title": "Group Data",
            "Keywords": "blazor, components, data grid, datagrid, grid, grouping, groups, drag-and-drop, devexpress, demo, sample, example",
            "Description": "The DevExpress Data Grid for Blazor component enables you to drag-and-drop grid headers or use grouping API to group data against multiple data columns."
          },
          {
            "Url": "GridSelection",
            "Title": "Selection",
            "Keywords": "blazor, components, data grid, datagrid, grid, selection, multi-selection, multiple-selection, devexpress, demo, sample, example",
            "Description": "The DevExpress Data Grid for Blazor component supports Single Row, Multiple Rows, and Multiple Rows with Optimized Performance selection modes.",
            "DemoPageSections": [
              {
                "Id": "SingleSelectedDataRow",
                "Title": "Single Row Selection"
              },
              {
                "Id": "MultipleSelectedDataRows",
                "Title": "Multiple Row Selection"
              },
              {
                "Id": "OptimizedMultipleSelection",
                "Title": "Multiple Selection with Optimized Performance"
              }
            ]
          },
          {
            "Url": "GridSummary",
            "Title": "Summary",
            "Keywords": "blazor, components, data grid, datagrid, grid, summary, summaries, totals, total values, total summary, total summaries, group summary, group summaries, data summaries, aggregates, aggregate functions, devexpress, demo, sample, example",
            "Description": "The DevExpress Data Grid for Blazor supports total and group summaries.",
            "DemoPageSections": [
              {
                "Id": "TotalSummary",
                "Title": "Total Summary"
              },
              {
                "Id": "GroupSummary",
                "Title": "Group Summary"
              }
            ]
          },
          {
            "Url": "GridHTMLDecoration",
            "Title": "HTML Decoration",
            "Keywords": "blazor, components, data grid, datagrid, grid, conditional formating, conditional data highlighting, alternative row, row style, row color, column style, cell style, custom style, html decoration, html row decoration, html cell decoration, html attributes, devexpress, demo, sample, example",
            "Description": "HTML decoration in DevExpress Data Grid for Blazor allows you to color data grid cells, rows and columns according to their values."
          },
          {
            "Url": "GridRemoteDataSource",
            "Title": "Remote Data Source",
            "Keywords": "blazor, components, data grid, datagrid, grid, web api support, bind to web api, combobox lookup column web api support, custom data binding, custom data source, remote data source, asynchronous data-aware operations, async support, bind to json data, devexpress, demo, sample, example",
            "Description": "DevExpress Data Grid for Blazor supports custom data sources (including large data sources) and asynchronous data-aware operations.",
            "DemoPageSections": [
              {
                "Id": "CustomDataSource",
                "Title": "Custom Data Source"
              },
              {
                "Id": "AsyncOperations",
                "Title": "Asynchronous Data-Aware Operations"
              }
            ]
          },
          {
            "Url": "GridToolbar",
            "Title": "Toolbar",
            "Keywords": "blazor, components, data grid, datagrid, grid, toolbar, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor  Data Grid can display a toolbar that aggregates buttons and commands related to the Data Grid and its data."
          },
          {
            "Url": "GridColumnChooser",
            "Title": "Column Chooser",
            "Keywords": "blazor, components, data grid, datagrid, grid, column chooser, columnchooser, columns, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Data Grid can display a Column Chooser in a toolbar. The Column Chooser is a separate window that allows users to show, hide, and reorder Data Grid columns at runtime.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "ShowInColumnChooser",
                "Title": "Hide a Column from the Column Chooser"
              }
            ]
          },
          {
            "Url": "GridEditData",
            "Title": "Edit Data",
            "Keywords": "blazor, components, data grid, datagrid, grid, data editing, edit data, edit form, popup edit form, add rows, add new row, insert row, remove rows, delete rows, edit row values, edit modes, edit options, command column, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Data Grid allows users to edit data in the edit form or in the popup edit form."
          },
          {
            "Url": "BindGridToData",
            "Title": "Data Binding",
            "Keywords": "blazor, components, data grid, datagrid, grid, data bind, data binding, bind to data, asynchronous data binding, bind to data asynchronously, async support, custom data source, custom data binding, web api support, bind to web api, remote data source, large data source, devexpress, demo, sample, example",
            "Description": "The DevExpress Data Grid for Blazor supports synchronous and asynchronous data binding to various data sources (including custom and large data sources).",
            "DemoPageSections": [
              {
                "Id": "Data",
                "Title": "Synchronous"
              },
              {
                "Id": "DataAsync",
                "Title": "Asynchronous"
              },
              {
                "Id": "CustomData",
                "Title": "Custom"
              },
              {
                "Id": "LargeData",
                "Title": "Large Datasets"
              }
            ]
          }
        ]
      },
      {
        "Title": "Pivot Grid",
        "DemoPages": [
          {
            "Url": "PivotGrid",
            "Title": "Overview",
            "Keywords": "Blazor, components, pivot grid, pivot table, sorting, grouping, sub-totals, grand-totals, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Pivot Grid summarizes data from the underlying data source and presents the results in cross-tabulated format. "
          },
          {
            "Url": "PivotGridTemplates",
            "Title": "Templates",
            "Keywords": "Blazor, components, pivot grid, pivot table, customization, cell templates, formatting, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Pivot Grid allows you to use native Razor markup to define custom templates for grid fields."
          },
          {
            "Url": "PivotGridLargeDataBase",
            "Title": "Large Data Source",
            "Keywords": "Blazor, components, pivot grid, pivot table, data binding, entity framework bind, paging, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Pivot Grid delivers high performance when the component is bound to a large data source."
          },
          {
            "Url": "PivotGridChartIntegration",
            "Title": "Chart Integration",
            "Keywords": "Blazor, components, pivot grid, pivot table, charts, pivot grid and chart integration, data visualization, devexpress, demo, sample, example",
            "Description": "The DevExpress Pivot Grid for Blazor can be easily integrated with DevExpress Charts for Blazor. This allows you to visualize grid's data on a chart."
          }
        ]
      },
      {
        "Title": "Charts",
        "DemoPages": [
          {
            "Url": "ChartSeriesTypes",
            "Title": "Series Types",
            "Keywords": "Blazor, components, charts, bar, line, area, bubble, series, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Charts supports the following series types: Line, Area, Bar, and Bubble series."
          },
          {
            "Url": "ChartDynamicSeries",
            "Title": "Dynamic Series",
            "Keywords": "Blazor, components, charts, dynamic series, series template, aggregation, grouping, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Charts allows you to dynamically select data that matches the specified criterion from a data source and display chart series based on this data."
          },
          {
            "Url": "ChartAxes",
            "Title": "Axes",
            "Keywords": "Blazor, charts, chart, customization, axes, multiple axes, chart rotation, rotating charts, swap axes, horizontal bars, continuous axis, discrete axis, logarithmic axis, axis types, argument types, value types, string values, date-time values, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Charts allow users to display multiple axes, swap axes (rotate the chart), and choose axis types",
            "DemoPageSections": [
              {
                "Id": "MultipleAxes",
                "Title": "Multiple Axes"
              },
              {
                "Id": "ChartRotation",
                "Title": "Rotation"
              },
              {
                "Id": "AxisTypes",
                "Title": "Axis Types"
              }
            ]
          },
          {
            "Url": "ChartCustomization",
            "Title": "Customization",
            "Keywords": "Blazor, components, charts, customization, tooltips, legend, toggle series, multiple axes, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Charts allows users to customize tooltips and legend items. Additionally, the component supports displaying charts with multiple axes that help to combine several charts. ",
            "DemoPageSections": [
              {
                "Id": "Tooltip",
                "Title": "Tooltip Customization"
              },
              {
                "Id": "Legend",
                "Title": "Legend Customization"
              },
              {
                "Id": "MultiplePanes",
                "Title": "Multiple Panes Customization"
              }
            ]
          },
          {
            "Url": "ChartRangeSeries",
            "Title": "Range Series",
            "Keywords": "Blazor, components, charts, range series, range area, range bar, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Charts supports Range Bar and Range Area series that display value ranges corresponding to argument values.",
            "DemoPageSections": [
              {
                "Id": "RangeBar",
                "Title": "Range Bar Series"
              },
              {
                "Id": "RangeArea",
                "Title": "Range Area Series"
              }
            ]
          },
          {
            "Url": "ChartFinancialSeries",
            "Title": "Financial Series",
            "Keywords": "Blazor, components, charts, candlestick, stock, financial, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Charts supports Candlestick and Stock series that display how financial indicators change in time.",
            "DemoPageSections": [
              {
                "Id": "Candlestick",
                "Title": "Candlestick Series"
              },
              {
                "Id": "Stock",
                "Title": "Stock Series"
              }
            ]
          },
          {
            "Url": "ChartPieSeries",
            "Title": "Pie Series",
            "Keywords": "Blazor, components, charts, pie, donut, doughnut, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Charts supports Pie and Donut series that allow you to compare the percentage values of different point arguments and illustrate these values as pie slices.",
            "DemoPageSections": [
              {
                "Id": "Pie",
                "Title": "Pie Series"
              },
              {
                "Id": "Donut",
                "Title": "Donut Series"
              }
            ]
          },
          {
            "Url": "ChartSeriesCustomization",
            "Title": "Series Customization",
            "Keywords": "Blazor, components, chart, series, label, point, customization, appearance, point color, custom text, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Charts allow users to customize series points and their labels' appearance and specify custom images for points.",
            "DemoPageSections": [
              {
                "Id": "Point",
                "Title": "Series Point Customization"
              },
              {
                "Id": "PointImage",
                "Title": "Series Point Image"
              },
              {
                "Id": "Label",
                "Title": "Series Label Customization"
              }
            ]
          }
        ]
      },
      {
        "Title": "Scheduler",
        "DemoPages": [
          {
            "Url": "SchedulerViewTypes",
            "Title": "View Types",
            "Keywords": "Blazor, components, scheduler, day view, work week view, week view, devexpress, demo, sample, example",
            "Description": "The Scheduler UI for Blazor can display regular and recurrent appointments in a Day, Work Week or Week View. The Scheduler also allows users to create, remove, and manage appointments.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "WeekView",
                "Title": "Week View"
              },
              {
                "Id": "WorkWeekView",
                "Title": "Work Week View"
              },
              {
                "Id": "DayView",
                "Title": "Day View"
              }
            ]
          },
          {
            "Url": "SchedulerRecurringAppointments",
            "Title": "Recurring Appointments",
            "Keywords": "Blazor, components, scheduler, recurring appointments, devexpress, demo, sample, example",
            "Description": "The Scheduler UI for Blazor can display regular and recurrent appointments in a Day, Work Week or Week View. The Scheduler also allows users to create, remove, and manage appointments."
          },
          {
            "Url": "SchedulerResources",
            "Title": "Resources",
            "Keywords": "Blazor, components, scheduler, resources, devexpress, demo, sample, example",
            "Description": "The DevExpress Scheduler for Blazor allows you to assign resources to appointments. You can also use this feature to group appointments by resource or by date.",
            "DemoPageSections": [
              {
                "Id": "GroupByResource",
                "Title": "Group by Resource"
              },
              {
                "Id": "GroupByDate",
                "Title": "Group by Date"
              },
              {
                "Id": "CustomResourceNavigator",
                "Title": "Custom Resource Navigator"
              }
            ]
          },
          {
            "Url": "SchedulerCustomization",
            "Title": "Customization",
            "Keywords": "Blazor, components, scheduler, appointments, template, appointment template, customization, custom appointment appearance, appointment style, custom appointment UI, custom fields, custom field, custom properties, custom property, appointment custom field, customize appointment, appointment customization, appointment form, appointment edit form, customize edit form, custom appointment form, devexpress, demo, sample, example",
            "Description": "The DevExpress Scheduler allows you to use templates to customize appointment appearance.",
            "DemoPageSections": [
              {
                "Id": "AppointmentTemplates",
                "Title": "Appointment Templates"
              },
              {
                "Id": "CustomAppointmentForm",
                "Title": "Custom Fields and Appointment Form",
                "IsNew": true
              }
            ]
          }
        ]
      },
      {
        "Title": "Editors",
        "DemoPages": [
          {
            "Url": "ComboBox",
            "Title": "ComboBox",
            "Keywords": "Blazor, components, combo box, combobox, data binding, databinding, data source, virtual scrolling, scrolling, custom input, filtering, data filtering, incremental filtering, null text, nulltext, cascading lists,  devexpress, demo, sample, example",
            "Description": "DevExpress Blazor ComboBox is a drop-down list editor that supports virtual scrolling, incremental filtering, and cascade logic.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "VirtualScrolling",
                "Title": "Virtual Scrolling"
              },
              {
                "Id": "MultipleColumns",
                "Title": "Multiple Columns"
              },
              {
                "Id": "AllowInput",
                "Title": "Allow Input"
              },
              {
                "Id": "IncrementalFiltering",
                "Title": "Incremental Filtering"
              },
              {
                "Id": "DropDownListWidth",
                "Title": "Drop-Down List Width"
              },
              {
                "Id": "NullText",
                "Title": "Clear Button and Placeholder"
              },
              {
                "Id": "ItemValues",
                "Title": "Item Values"
              },
              {
                "Id": "CascadingLists",
                "Title": "Cascading Lists"
              },
              {
                "Id": "ReadOnly",
                "Title": "Read-Only and Disabled Modes",
                "IsUpdated": true
              }
            ]
          },
          {
            "Url": "SpinEdit",
            "Title": "Spin Edit",
            "Keywords": "blazor, components, spinedit, spin edit, number editor, null text, prompt text, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Spin Edit allows the user to modify numeric data by typing a new value into the text box or by using the up/down spin buttons to increment/decrement the value.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "BindValueOnInputChange",
                "Title": "Bind Value On Input Change"
              },
              {
                "Id": "CustomIncrement",
                "Title": "Custom Increment"
              },
              {
                "Id": "NullableValue",
                "Title": "Nullable Value and Placeholder"
              },
              {
                "Id": "DisplayFormat",
                "Title": "Display Format"
              },
              {
                "Id": "ReadOnly",
                "Title": "Read-Only and Disabled Modes",
                "IsUpdated": true
              }
            ]
          },
          {
            "Url": "CheckBox",
            "Title": "CheckBox",
            "Keywords": "blazor, components, checkbox, check box, indeterminate checkbox, image in checkbox, switch, toggle, custom text, customization, label, data binding, databinding, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor CheckBox is a check editor that allows users to select yes/no or true/false. The component supports the indeterminate state, binding to custom data types, and the Switch mode.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "Alignment",
                "Title": "Alignment"
              },
              {
                "Id": "AllowUsersToSetIndeterminateState",
                "Title": "Allow Users to Set Indeterminate State"
              },
              {
                "Id": "BindToCustomDataTypes",
                "Title": "Bind to Custom Data Types"
              },
              {
                "Id": "SwitchMode",
                "Title": "Switch Mode"
              }
            ]
          },
          {
            "Url": "DateEdit",
            "Title": "Date Edit",
            "Keywords": "blazor, components, date edit, dateedit, date, date and time, calendar, null text, prompt text, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Date Edit is a date editor with a drop-down calendar or an adaptive scroll picker. The component allows you to enter a date into the text box or pick one from the drop-down window.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "TimeSection",
                "Title": "Time Section",
                "IsNew": true
              },
              {
                "Id": "NullableDate",
                "Title": "Null Date Values and Placeholder"
              },
              {
                "Id": "DisplayFormat",
                "Title": "Display Format"
              },
              {
                "Id": "DateRange",
                "Title": "Date Range"
              },
              {
                "Id": "DisabledDates",
                "Title": "Disabled Dates"
              },
              {
                "Id": "AdaptiveScrollPicker",
                "Title": "Adaptive Datepicker"
              },
              {
                "Id": "ReadOnly",
                "Title": "Read-Only and Disabled Modes",
                "IsUpdated": true
              }
            ]
          },
          {
            "Url": "TimeEdit",
            "Title": "Time Edit",
            "Keywords": "blazor, components, time edit, timeedit, time, null text, prompt text, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Time Edit is a time editor with a drop-down time picker. A user can enter the time into the text box or pick it in the drop-down window.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "NullableTime",
                "Title": "Null Time Values and Placeholder"
              },
              {
                "Id": "DisplayFormat",
                "Title": "Display Format"
              },
              {
                "Id": "TimeRange",
                "Title": "Time Range"
              },
              {
                "Id": "ReadOnly",
                "Title": "Read-Only and Disabled Modes"
              }
            ]
          },
          {
            "Url": "TextBox",
            "Title": "Text Box",
            "Keywords": "blazor, components, text box, textbox, memo, null text, prompt text, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Text Box is a single-line editor that enables a user to enter and edit text. The component also supports binding to a data source and password mode.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "BindValueOnInputChange",
                "Title": "Bind Value On Input Change"
              },
              {
                "Id": "ClearButton",
                "Title": "Clear Button and Placeholder"
              },
              {
                "Id": "Password",
                "Title": "Password"
              },
              {
                "Id": "ReadOnly",
                "Title": "Read-Only and Disabled Modes",
                "IsUpdated": true
              }
            ]
          },
          {
            "Url": "Calendar",
            "Title": "Calendar",
            "IsNew": true,
            "Keywords": "blazor, components, calendar, date, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Calendar allows users to select dates and navigate through months and years. The component supports multiple date selection and cell customization.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "MultiSelect",
                "Title": "Multiple Selection"
              },
              {
                "Id": "DateRange",
                "Title": "Date Range"
              },
              {
                "Id": "DisabledDates",
                "Title": "Disabled Dates"
              },
              {
                "Id": "DayCellCustomization",
                "Title": "Day Cell Customization"
              }
            ]
          },
          {
            "Url": "ListBox",
            "Title": "List Box",
            "IsNew": true,
            "Keywords": "Blazor, components, list box, listbox, list editor, readonly list, read-only list, data binding, databinding, data source, virtual scrolling, scrolling, select, select multiple, select option checkbox, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor List Box allows users to select items from a list of predefined strings. The component supports multiple item selection, virtual scrolling and read-only mode.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "MultipleColumns",
                "Title": "Multiple Columns"
              },
              {
                "Id": "MultipleSelection",
                "Title": "Multiple Selection"
              },
              {
                "Id": "ItemValues",
                "Title": "Item Values"
              },
              {
                "Id": "VirtualScrolling",
                "Title": "Virtual Scrolling"
              },
              {
                "Id": "ReadOnly",
                "Title": "Read-Only and Disabled Modes",
                "IsUpdated": true
              }
            ]
          },
          {
            "Url": "TagBox",
            "Title": "TagBox",
            "IsNew": true,
            "Keywords": "Blazor, components, tag box, tagbox, tags, custom tags, data binding, databinding, data source, virtual scrolling, scrolling, filtering, incremental filtering, starts with filtering, contains filtering, null text, nulltext, templates, validation, read-only tagbox, multiple tag selection, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor TagBox allows users to select multiple tags from a drop-down list or type custom tags. TagBox supports incremental filtering, virtual scrolling, validation, and templates.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "CustomTags",
                "Title": "Custom Tags"
              },
              {
                "Id": "ItemValues",
                "Title": "Item Values"
              },
              {
                "Id": "MultipleColumns",
                "Title": "Multiple Columns"
              },
              {
                "Id": "NullText",
                "Title": "Clear Button and Placeholder"
              },
              {
                "Id": "VirtualScrolling",
                "Title": "Virtual Scrolling"
              },
              {
                "Id": "FilterModes",
                "Title": "Filter Modes"
              },
              {
                "Id": "DropDownListWidth",
                "Title": "Drop-Down List Width"
              },
              {
                "Id": "ShowSelectedItems",
                "Title": "Show Selected Items"
              },
              {
                "Id": "ReadOnly",
                "Title": "Read-Only and Disabled Modes",
                "IsUpdated": true
              },
              {
                "Id": "TagTemplate",
                "Title": "Tag Template"
              },
              {
                "Id": "Validation",
                "Title": "Validation"
              }
            ]
          }, 
          {
            "Url": "Memo",
            "Title": "Memo",
            "IsNew": true,
            "Keywords": "Blazor, components, memo, text area, multi-line text box, text in multiple lines, text in multiple rows, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Memo is a multi-line text area that allows users to type and edit text in multiple rows.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "CustomSize",
                "Title": "Custom Size"
              },
              {
                "Id": "ResizeModes",
                "Title": "Resize Modes"
              },
              {
                "Id": "ClearButton",
                "Title": "Clear Button and Placeholder"
              },
              {
                "Id": "ReadOnly",
                "Title": "Read-Only and Disabled Modes",
                "IsUpdated": true
              }
            ]
          }
        ]
      },
      {
        "Title": "Buttons",
        "DemoPages": [
          {
            "Url": "Button",
            "Title": "Button",
            "Keywords": "Blazor, components, button, buttons, action, button styles, button with icon, button with image, Blazor button for bootstrap, submit button, button click, template, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Button supports various render styles and can display icons. Button supports the disable state, form submission, templates, and HTML attributes. ",
            "DemoPageSections": [
              {
                "Id": "Style",
                "Title": "Styles"
              },
              {
                "Id": "Icons",
                "Title": "Icons"
              },
              {
                "Id": "CustomContent",
                "Title": "Custom Content"
              }
            ]
          }
        ]
      },
      {
        "Title": "Navigation and Layout",
        "DemoPages": [
          {
            "Url": "ContextMenu",
            "Title": "Context Menu",
            "Keywords": "blazor, components, menu, context menu, contextmenu, popup menu,  devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Context Menu allows you to add a context menu to your Blazor application. You can populate the Context Menu items manually or bound the component to a hierarchical data structure.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "DataBinding",
                "Title": "Bind to Hierarchical Data"
              }
            ]
          },
          {
            "Url": "FormLayout",
            "Title": "Form Layout",
            "Keywords": "blazor, components, form, form editor, form layout, formlayout, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Form Layout allows you to construct responsive and automatically-aligned edit forms. Form Layout can group items, display UI elements in tabs. You can also bind the component to a data source.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "CaptionPosition",
                "Title": "Caption Position"
              },
              {
                "Id": "ItemWrapping",
                "Title": "Item Wrapping"
              },
              {
                "Id": "Groups",
                "Title": "Groups"
              },
              {
                "Id": "TabbedGroups",
                "Title": "Tabbed Groups"
              },
              {
                "Id": "DataBinding",
                "Title": "Bind to Data"
              }
            ]
          },
          {
            "Url": "TreeView",
            "Title": "TreeView",
            "Keywords": "Blazor, components, treeview, tree view, tree component, navigation, tree navigation, selection, node selection, hierarchical data binding, hierarchical databinding, binding to hierarchical data, hierarchical data source, hierarchy, nodes, display master-detail data, display master-detail object, display master-detail objects, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor TreeView displays hierarchical data structures within a tree-like UI. The component supports data binding and master-detail relationships.",
            "DemoPageSections": [
              {
                "Id": "Selection",
                "Title": "Node Selection"
              },
              {
                "Id": "HierarchicalDataBinding",
                "Title": "Bind to Hierarchical Data"
              },
              {
                "Id": "MasterDetailDataBinding",
                "Title": "Bind to Master-Detail Data"
              },
              {
                "Id": "LoadChildNodesOnDemand",
                "Title": "Load Child Nodes on Demand Mode"
              },
              {
                "Id": "Templates",
                "Title": "Templates"
              }
            ]
          },
          {
            "Url": "Tabs",
            "Title": "Tabs",
            "Keywords": "blazor, components, tab, tabs, tabcontrol, tab control, pagecontrol, page control, page component, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Tabs allows you to implement tabbed layout and control an active tab from code. You can also use this component to emulate a Page control in your Blazor application.",
            "DemoPageSections": [
              {
                "Id": "SimpleTabControl",
                "Title": "Overview"
              },
              {
                "Id": "TabPage",
                "Title": "Tab Pages"
              },
              {
                "Id": "PageControl",
                "Title": "Active Tab"
              }
            ]
          },
          {
            "Url": "Pager",
            "Title": "Pager",
            "Keywords": "blazor, components, pager, pages, pager component, pages component, go to page, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Pager enables data navigation and helps visualize a current position within a bound data source. The component allows you to set up the total number of pages and the number of visible page numbers.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "GotoPage",
                "Title": "Go to Page"
              },
              {
                "Id": "AllPageNumbers",
                "Title": "All Page Numbers Visible"
              },
              {
                "Id": "LimitPageButtonsNumber",
                "Title": "Limit the Number of Page Buttons"
              }
            ]
          },
          {
            "Url": "Popup",
            "Title": "Popup",
            "IsNew": true,
            "Keywords": "blazor, components, popup, window, dialog, popup dialog, popup window, modal popup, modal dialog, modal window, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Popup is a pop-up window that overlays the current view. The component consists of a customizable header, pop-up body, and footer.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "HeaderCustomization",
                "Title": "Header Customization"
              },
              {
                "Id": "DisplayFooter",
                "Title": "Display Footer"
              }
            ]
          },
          {
            "Url": "Toolbar",
            "Title": "Toolbar",
            "IsNew": true,
            "Keywords": "blazor, components, toolbar, toolbar component, button, adaptivity, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Toolbar allows you to implement an adaptive button-based interface in your web application. The component supports drop-down, checked, and radio buttons and allows you to define item templates.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "DropDownItems",
                "Title": "Drop-Down Items"
              },
              {
                "Id": "RenderStyle",
                "Title": "Render Style"
              },
              {
                "Id": "CheckedAndRadioButtons",
                "Title": "Checked and Radio Buttons"
              },
              {
                "Id": "ItemTemplates",
                "Title": "Item Templates"
              },
              {
                "Id": "Adaptivity",
                "Title": "Adaptivity"
              }
            ]
          },
          {
            "Url": "GridLayout",
            "Title": "Grid Layout",
            "IsNew": true,
            "Keywords": "Blazor, components, page layout, grid layout, layout, layout breakpoints, breakpoint, adaptive UI, adaptivity, adaptive layout, responsive layout, responsive UI, arrange UI elements, layout items, rows, columns, areas, template areas, layout areas, grid areas, devexpress, demo, sample, example",
            "Description": "The DevExpress Grid Layout component allows you to arrange UI elements on a page. The component is based on a CSS Grid Layout: layout items are organized into rows and columns. DxLayoutBreakpoint allows you to adapt a page layout to different screen sizes. For example, you can use breakpoints to create responsive DxGridLayout, DxStackLayout, or other components.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "Areas",
                "Title": "Areas"
              },
              {
                "Id": "Adaptivity",
                "Title": "Adaptivity"
              }
            ]
          },
          {
            "Url": "StackLayout",
            "Title": "Stack Layout",
            "IsNew": true,
            "Keywords": "Blazor, components, page layout, stack layout, layout, arrange UI elements, layout items, devexpress, demo, sample, example",
            "Description": "The DevExpress Stack Layout component allows you to stack UI elements vertically or horizontally."
          }
        ]
      },
      {
        "Title": "File Management",
        "DemoPages": [
          {
            "Url": "Upload",
            "Title": "Upload",
            "Keywords": "blazor, components, upload, upload control, file upload, file upload control, upload files, blazor upload, chunk upload, large files upload, large files, delayed upload, delay file upload, multi-file selection, drag and drop, external drop zone, validation, limit uploaded file size, validate uploaded file extension, devexpress, demo, sample, example",
            "Description": "DevExpress Blazor Upload allows users to upload files to the server. It supports drag and drop, chunk upload for large files, multi-file selection, and validation.",
            "DemoPageSections": [
              {
                "Id": "Overview",
                "Title": "Overview"
              },
              {
                "Id": "ChunkUpload",
                "Title": "Chunk Upload"
              },
              {
                "Id": "MultiFileSelection",
                "Title": "Multiple File Selection"
              },
              {
                "Id": "UploadModes",
                "Title": "Upload Modes"
              },
              {
                "Id": "Validation",
                "Title": "Validation"
              }
            ]
          }
        ]
      },
      {
        "Url": "FormValidation",
        "Title": "Form Validation",
        "Icon": "images/GridColumnType.svg",
        "Keywords": "blazor, components, form, form validation, data validation, devexpress, demo, sample, example",
        "Description": "The DevExpress UI components for Blazor support the built-in form validation. You can validate DevExpress Blazor data editors, Form Layout, or  your custom edit form.",
        "DemoPageSections": [
          {
            "Id": "Overview",
            "Title": "Overview"
          },
          {
            "Id": "FormLayout",
            "Title": "Form Layout"
          },
          {
            "Id": "CustomForm",
            "Title": "Custom Form"
          }
        ]
      }
    ]
  }
}
